app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'job_title' => ['nullable', 'string', 'max:255'], // Validate job title
            'email' => ['required', 'string', 'email', 'max:255', 'unique:' . User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
            'profile_image' => ['nullable', 'file', 'mimes:jpeg,png,jpg,gif,svg', 'max:2048'], // Validate profile image
        ]);

        // Handle profile image upload
        $profileImagePath = null;
        if ($request->hasFile('profile_image')) {
            $profileImagePath = $request->file('profile_image')->store('profile_images', 'public');
        }

        $user = User::create([
            'name' => $request->name,
            'job_title' => $request->job_title, // Save job title
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'profile_image' => $profileImagePath, // Save profile image path
        ]);
---
insert into `users` (`name`, `job_title`, `email`, `password`, `profile_image`, `updated_at`, `created_at`) values ('Gwen Bautista', null, 'gwen@gmail.com', '$2y$12$J42AdCBRb9eL6XCRZbuMcOacKXNuxm799T8BlQ8/FYOs0gxBZibYC', null, '2024-10-23 07:49:09', '2024-10-23 07:49:09')