routes/web.php

select * from `posts` limit 10 offset 0
select count(*) as aggregate from `posts`
---
use App\Models\Post;

<<<<<<< Updated upstream
Route::get('/', function () {
    $posts = Post::paginate(10); // Use the Post model and paginate the posts
    return view('home', ['posts' => $posts]);
});