app/Http/Controllers/PostController.php

select * from `posts` limit 10 offset 0
select count(*) as aggregate from `posts`
---
    public function index()
    {
        $posts = Post::paginate(10); // Fetch all posts

select * from `posts` where `posts`.`id` = '1' limit 1
---
    public function show(string $id)
    {
        $post = Post::findOrFail($id); // Fetch the post by ID