app/Http/Controllers/ProfileController.php

public function update(ProfileUpdateRequest $request): RedirectResponse
{
    $user = $request->user();

    // Store the original image path
    $originalImagePath = $user->profile_image;

    // Update the user
    $user->fill($request->validated());

    // Attempt to update or create the user
    if ($user->update($request->validated())) {
---
update `users` set `profile_image` = 'C:\\xampp\\tmp\\php8F29.tmp', `users`.`updated_at` = '2024-10-23 09:25:43' where `id` = 6