app/Http/Controllers/UserPostController.php

public function index()
{
    // Retrieve the posts of the authenticated user
    $posts = Auth::user()->posts()->with('user')->paginate();
---
select * from `posts` where `posts`.`user_id` = 37 and `posts`.`user_id` is not null limit 15 offset 0
select * from `users` where `users`.`id` in (37)
select count(*) as aggregate from `posts` where `posts`.`user_id` = 6 and `posts`.`user_id` is not null